IDEA Open Model
MaterialStrengthProperty.List Property
Compatible with IDEA StatiCa v 10.1
 Collection of material strength levels
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public List<MaterialStrength> List { get; set; }
Public Property List As List(Of MaterialStrength)
	Get
	Set
public:
property List<MaterialStrength^>^ List {
	List<MaterialStrength^>^ get ();
	void set (List<MaterialStrength^>^ value);
}
Property Value
Type: List<MaterialStrength>
See Also
Reference
MaterialStrengthProperty Class
IdeaRS.OpenModel.Material Namespace